## Plan output — dev-dc

```
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.app.data.aws_ec2_managed_prefix_list.cloudfront: Reading...
module.app.module.api.aws_ssm_parameter.otel_config: Refreshing state... [id=/sebt-portal-dc/development/api/otel]
module.app.module.ses.aws_secretsmanager_secret.smtp: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:382156381095:secret:sebt-portal-dc-development-ses-smtp-credentials-27jZOh]
module.app.module.api.module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:382156381095:cluster/sebt-portal-dc-development-api]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
data.aws_ecr_repository.web: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.app.module.secrets.data.aws_partition.current: Reading...
module.app.module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.app.module.ses.data.aws_region.current: Reading...
module.app.module.web.module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:382156381095:cluster/sebt-portal-dc-development-web]
module.app.module.ses.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_partition.current: Reading...
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.app.module.web.aws_iam_role.execution: Refreshing state... [id=sebt-portal-dc-development-web-exec]
module.logging.data.aws_region.current: Reading...
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app.module.web.aws_iam_role.task: Refreshing state... [id=sebt-portal-dc-development-web-task]
module.logging.data.aws_lambda_functions.all: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 1s [id=874300523]
module.app.module.ses.aws_iam_user.smtp: Refreshing state... [id=sebt-portal-dc-development-ses-smtp]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 1s [id=3701104373]
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 1s [id=1315226949]
module.app.module.api.aws_acm_certificate.endpoint["this"]: Refreshing state... [id=arn:aws:acm:us-east-1:382156381095:certificate/a202bb33-aebb-4af0-8cec-7ed1131c625a]
module.logging.module.s3.aws_s3_bucket.main: Refreshing state... [id=sebt-portal-dc-development-logs]
module.logging.module.s3.data.aws_region.current: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 1s [id=2187510914]
module.logging.module.s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app.data.aws_ec2_managed_prefix_list.cloudfront: Read complete after 1s [id=pl-3b927c52]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.app.module.api.data.aws_partition.current: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.app.module.api.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.module.s3.data.aws_partition.current: Reading...
data.aws_ecr_repository.api: Reading...
module.logging.module.s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.app.module.ses.aws_ses_domain_identity.main: Refreshing state... [id=dev.dc.sebt-portal.codeforamerica.app]
module.app.module.secrets.data.aws_caller_identity.identity: Reading...
module.app.module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=382156381095]
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.app.module.api.module.alb["this"].data.aws_partition.current: Reading...
module.app.module.api.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.data.aws_caller_identity.identity: Reading...
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=382156381095]
module.app.module.database.data.aws_region.current: Reading...
module.app.module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=382156381095]
module.app.module.web.data.aws_region.current: Reading...
module.app.module.web.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_availability_zones.available: Reading...
module.app.module.api.aws_iam_role.task: Refreshing state... [id=sebt-portal-dc-development-api-task]
module.logging.module.s3.data.aws_caller_identity.current: Reading...
data.aws_ecr_repository.web: Read complete after 1s [id=sebt-portal-dc-development-web]
module.app.module.database.data.aws_caller_identity.current: Reading...
module.logging.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.app.module.api.data.aws_region.current: Reading...
module.app.module.api.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app.module.web.module.alb["this"].data.aws_partition.current: Reading...
module.app.module.web.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app.module.ses.data.aws_partition.current: Reading...
module.app.module.ses.data.aws_partition.current: Read complete after 0s [id=aws]
module.app.module.api.data.aws_caller_identity.identity: Reading...
module.logging.module.s3.data.aws_caller_identity.current: Read complete after 0s [id=382156381095]
module.app.module.database.data.aws_rds_engine_version.this: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
data.aws_route53_zone.main: Reading...
module.logging.module.s3.data.aws_organizations_organization.current: Reading...
module.app.module.database.data.aws_caller_identity.current: Read complete after 0s [id=382156381095]
module.app.module.web.data.aws_caller_identity.identity: Reading...
module.app.module.web.aws_acm_certificate.endpoint["this"]: Refreshing state... [id=arn:aws:acm:us-east-1:382156381095:certificate/e2e06f94-e8b6-427d-bbc0-daa7a3065572]
module.app.module.secrets.data.aws_region.current: Reading...
module.app.module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app.module.web.aws_ssm_parameter.otel_config: Refreshing state... [id=/sebt-portal-dc/development/web/otel]
module.app.module.api.data.aws_caller_identity.identity: Read complete after 0s [id=382156381095]
module.app.module.web.data.aws_partition.current: Reading...
module.app.module.web.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.app.module.database.data.aws_partition.current: Reading...
module.app.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01fb1a10ad1f6cc36]
module.app.module.web.data.aws_caller_identity.identity: Read complete after 0s [id=382156381095]
module.app.module.api.aws_iam_role.execution: Refreshing state... [id=sebt-portal-dc-development-api-exec]
module.app.module.api.module.ecs.aws_ecs_cluster_capacity_providers.main[0]: Refreshing state... [id=sebt-portal-dc-development-api]
data.aws_ecr_repository.api: Read complete after 0s [id=sebt-portal-dc-development-api]
module.app.module.web.module.ecs.aws_ecs_cluster_capacity_providers.main[0]: Refreshing state... [id=sebt-portal-dc-development-web]
module.vpc.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20260226064209208000000004]
module.app.module.ses.aws_iam_access_key.smtp: Refreshing state... [id=AKIAVR6SLTOTR2JPQDP7]
module.app.module.ses.aws_iam_user_policy.smtp: Refreshing state... [id=sebt-portal-dc-development-ses-smtp:ses-send]
module.app.module.database.data.aws_rds_engine_version.this: Read complete after 0s [id=16.00.4215.2.v1]
module.app.module.ses.aws_ses_domain_dkim.main: Refreshing state... [id=dev.dc.sebt-portal.codeforamerica.app]
module.app.module.ses.aws_ses_domain_mail_from.main: Refreshing state... [id=dev.dc.sebt-portal.codeforamerica.app]
module.app.module.secrets.aws_kms_key.secrets: Refreshing state... [id=a8c1f38b-c8bf-4ebd-b918-08c31f8b77b1]
module.app.module.database.aws_kms_key.database: Refreshing state... [id=d6cd4c15-f2f8-401a-af1e-5ab1e79a26f5]
module.app.module.web.aws_kms_key.fargate: Refreshing state... [id=d7719898-d4b9-496f-94bd-5a0775d6ca2b]
module.app.module.ses.aws_secretsmanager_secret_version.smtp: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:382156381095:secret:sebt-portal-dc-development-ses-smtp-credentials-27jZOh|terraform-20260226064219385000000005]
module.app.module.api.aws_kms_key.fargate: Refreshing state... [id=269a097b-a66a-434d-8ad3-b13101d49af6]
module.logging.module.s3.data.aws_organizations_organization.current: Read complete after 0s [id=o-f5mr0gq6lc]
data.aws_route53_zone.main: Read complete after 0s [id=Z099642439GM3YJ1G5DMR]
module.app.module.ses.aws_route53_record.ses_verification: Refreshing state... [id=Z099642439GM3YJ1G5DMR__amazonses.dev.dc.sebt-portal.codeforamerica.app_TXT]
module.app.module.ses.aws_route53_record.dkim[0]: Refreshing state... [id=Z099642439GM3YJ1G5DMR_lq3g2pprib6se7isrpwq7tw7odxjhx2n._domainkey.dev.dc.sebt-portal.codeforamerica.app_CNAME]
module.app.module.ses.aws_route53_record.dkim[1]: Refreshing state... [id=Z099642439GM3YJ1G5DMR_j3d7nyk5tgi2nww6iypap36bqfw5znsi._domainkey.dev.dc.sebt-portal.codeforamerica.app_CNAME]
module.app.module.ses.aws_route53_record.dkim[2]: Refreshing state... [id=Z099642439GM3YJ1G5DMR_ivgcxgm7nlpp5njkuq6nklpqomxj6r76._domainkey.dev.dc.sebt-portal.codeforamerica.app_CNAME]
module.app.module.ses.aws_route53_record.mx_mail_from: Refreshing state... [id=Z099642439GM3YJ1G5DMR_bounce.dev.dc.sebt-portal.codeforamerica.app_MX]
module.app.module.ses.aws_route53_record.spf_mail_from: Refreshing state... [id=Z099642439GM3YJ1G5DMR_bounce.dev.dc.sebt-portal.codeforamerica.app_TXT]
module.app.module.ses.aws_route53_record.dmarc: Refreshing state... [id=Z099642439GM3YJ1G5DMR__dmarc.dev.dc.sebt-portal.codeforamerica.app_TXT]
module.app.module.web.aws_route53_record.endpoint_validation["origin.dev.dc.sebt-portal.codeforamerica.app"]: Refreshing state... [id=Z099642439GM3YJ1G5DMR__08a94d6767534b48bf7e060b53a11b56.origin.dev.dc.sebt-portal.codeforamerica.app._CNAME]
module.app.module.api.aws_route53_record.endpoint_validation["api.dev.dc.sebt-portal.codeforamerica.app"]: Refreshing state... [id=Z099642439GM3YJ1G5DMR__19ee8f977989ce98b6a8bfa4f94ad08c.api.dev.dc.sebt-portal.codeforamerica.app._CNAME]
module.app.module.database.aws_kms_alias.database: Refreshing state... [id=alias/sebt-portal-dc/development/database]
module.app.module.web.aws_kms_alias.fargate: Refreshing state... [id=alias/sebt-portal-dc/development/web]
module.app.module.secrets.aws_kms_alias.secrets: Refreshing state... [id=alias/sebt-portal-dc/development/api/secrets]
module.app.module.api.aws_kms_alias.fargate: Refreshing state... [id=alias/sebt-portal-dc/development/api]
module.logging.module.s3.aws_s3_bucket_versioning.main: Refreshing state... [id=sebt-portal-dc-development-logs]
module.logging.module.s3.aws_s3_bucket_ownership_controls.main: Refreshing state... [id=sebt-portal-dc-development-logs]
module.logging.module.s3.aws_s3_bucket_public_access_block.main: Refreshing state... [id=sebt-portal-dc-development-logs]
module.logging.module.s3.data.aws_iam_policy_document.default: Reading...
module.logging.module.s3.aws_s3_bucket_server_side_encryption_configuration.main: Refreshing state... [id=sebt-portal-dc-development-logs]
module.logging.module.s3.data.aws_iam_policy_document.default: Read complete after 0s [id=2022588387]
module.app.module.web.aws_iam_policy.execution: Refreshing state... [id=arn:aws:iam::382156381095:policy/sebt-portal-dc-development-web-execution]
module.app.module.api.aws_iam_policy.execution: Refreshing state... [id=arn:aws:iam::382156381095:policy/sebt-portal-dc-development-api-execution]
module.logging.aws_kms_key.logs: Refreshing state... [id=2dcf416c-59e2-456b-bc6a-d3e510a7029b]
module.logging.aws_s3_bucket_object_lock_configuration.lock["this"]: Refreshing state... [id=sebt-portal-dc-development-logs]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0438a8bd6702d454b]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-03fe4c8e4cfeee863]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0278b420ff87850df]
module.app.module.web.aws_acm_certificate_validation.endpoint["this"]: Refreshing state... [id=2026-02-26 06:42:54.104 +0000 UTC]
module.app.module.api.aws_acm_certificate_validation.endpoint["this"]: Refreshing state... [id=2026-02-26 06:42:42.263 +0000 UTC]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0376ad602af7cc7bc]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-094d6b219a46987c0]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0f036da4082ff6e28]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0c6242f4dce650e92]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0bd46cf8067c947f6]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-06a8110ca599eb013]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09b25082bc6938853]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0ec93c6d65c987400]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f5f9331439c57e0e]
module.app.module.web.aws_iam_policy.secrets: Refreshing state... [id=arn:aws:iam::382156381095:policy/sebt-portal-dc-development-web-secrets-access-2026022606425388580000000f]
module.logging.module.s3.data.aws_iam_policy_document.combined: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Read complete after 0s [id=1902672782]
module.app.module.secrets.module.secrets_manager["app"].aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:382156381095:secret:sebt-portal-dc/development/api/app-20260226064251797700000008-GdyakE]
module.logging.aws_kms_alias.logs: Refreshing state... [id=alias/sebt-portal-dc/development/logs]
module.logging.aws_cloudwatch_log_group.logs["waf"]: Refreshing state... [id=aws-waf-logs-cfa/sebt-portal-dc/development]
module.logging.module.s3.aws_s3_bucket_policy.main: Refreshing state... [id=sebt-portal-dc-development-logs]
module.vpc.module.endpoints.aws_security_group.this[0]: Refreshing state... [id=sg-0409795f746797b00]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-069e9655e2a2f0cc5]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0345ab7955792e118]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-024b0f7d0c188801f]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0376ad602af7cc7bc1080289494]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b0a0cf8d9d8ad3e3]
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 1s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 1s [id=us-east-1]
module.app.module.secrets.module.secrets_manager["app"].aws_secretsmanager_secret_version.ignore_changes[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:382156381095:secret:sebt-portal-dc/development/api/app-20260226064251797700000008-GdyakE|terraform-2026022606425252840000000b]
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 1s [id=us-east-1]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-03439bf16878a81ef]
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 1s [id=us-east-1]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d5c37174c7c68499]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 1s [id=us-east-1]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0109a18cbe52fc926]
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 1s [id=us-east-1]
module.app.module.web.aws_iam_role_policy_attachments_exclusive.task: Refreshing state...
module.app.module.web.aws_iam_role_policy_attachments_exclusive.execution: Refreshing state...
module.vpc.module.endpoints.aws_security_group_rule.this["ingress_https"]: Refreshing state... [id=sgrule-2264104593]
module.app.module.database.aws_security_group.database: Refreshing state... [id=sg-023f096dd98694bc3]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 0s [id=us-east-1]
module.app.module.api.data.aws_vpc.current: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 0s [id=us-east-1]
module.app.module.web.data.aws_vpc.current: Reading...
module.app.module.database.aws_cloudwatch_log_group.agent: Refreshing state... [id=/aws/rds/instance/sebt-portal-dc-development-db/agent]
module.app.module.database.aws_cloudwatch_log_group.error: Refreshing state... [id=/aws/rds/instance/sebt-portal-dc-development-db/error]
module.app.module.api.aws_cloudwatch_log_group.this["service"]: Refreshing state... [id=/aws/ecs/sebt-portal-dc/development/api]
module.app.module.web.aws_cloudwatch_log_group.this["service"]: Refreshing state... [id=/aws/ecs/sebt-portal-dc/development/web]
module.vpc.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-01fb1a10ad1f6cc36]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e159cc8ac6757246]
module.app.module.web.module.endpoint_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0b86ebb5fa6843585]
module.app.module.web.module.alb["this"].aws_security_group.this[0]: Refreshing state... [id=sg-053f9b450b7b32bf0]
module.app.module.web.module.alb["this"].aws_lb_target_group.this["endpoint"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:382156381095:targetgroup/sebt-development-web-app/fae0330e3876b715]
module.app.module.web.module.prefix_security_group["this"].aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-007584e9674a55cc3]
module.app.module.api.module.endpoint_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0df3a41a95f89b362]
module.app.module.api.module.alb["this"].aws_security_group.this[0]: Refreshing state... [id=sg-0ce7b0809867b7270]
module.app.module.api.module.alb["this"].aws_lb_target_group.this["endpoint"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:382156381095:targetgroup/sebt-development-api-app/5c17561ece9aa129]
module.app.module.web.module.task_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-004f357f095a33de3]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-094d6b219a46987c01080289494]
module.app.module.database.aws_db_subnet_group.main: Refreshing state... [id=sebt-portal-dc-development-db-subnet-group]
module.vpc.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-096b45d6b1fac0137]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2181973308]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.app.module.web.data.aws_vpc.current: Read complete after 0s [id=vpc-01fb1a10ad1f6cc36]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=1315226949]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.app.module.api.data.aws_vpc.current: Read complete after 0s [id=vpc-01fb1a10ad1f6cc36]
module.vpc.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::382156381095:policy/vpc-flow-log-to-cloudwatch-20260226064255546800000017]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.app.module.web.module.prefix_security_group["this"].aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-139445643]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=874300523]
module.logging.module.s3.aws_s3_bucket_lifecycle_configuration.main[0]: Refreshing state... [id=sebt-portal-dc-development-logs]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.app.module.web.module.task_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3393881033]
module.app.module.web.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-2020654350]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.app.module.web.module.endpoint_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3646936215]
module.app.module.api.module.alb["this"].aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:382156381095:loadbalancer/app/sebt-development-api/189f37944ccc954a]
module.app.module.web.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3571609149]
module.app.module.web.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-3331517389]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 0s [id=1808222790]
module.app.module.api.module.endpoint_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1597936268]
module.app.module.api.module.task_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0e519b6eb305882a0]
module.app.module.web.module.alb["this"].aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:382156381095:loadbalancer/app/sebt-development-web/047fda3ce1cc1fe6]
module.app.module.api.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-803642062]
module.app.module.api.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-1137939634]
module.app.module.database.aws_db_instance.main: Refreshing state... [id=db-3UP3UVPGJXVBEKOPIAMU3BFDUQ]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm"]: Refreshing state... [id=vpce-05e47026619464630]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm-contacts"]: Refreshing state... [id=vpce-0dd08d3f7fbcd2fb6]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ecr.dkr"]: Refreshing state... [id=vpce-0f3d22c3b3529c229]
module.vpc.module.endpoints.aws_vpc_endpoint.this["s3"]: Refreshing state... [id=vpce-09dcd6d2a82a53263]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ecr.api"]: Refreshing state... [id=vpce-0d4ec787552926e4d]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm-incidents"]: Refreshing state... [id=vpce-0ec523f73506a6291]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ec2"]: Refreshing state... [id=vpce-07703ee6d10ad7daa]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ec2messages"]: Refreshing state... [id=vpce-0b6a2aec4168bc930]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssmmessages"]: Refreshing state... [id=vpce-0770ed769eefb4797]
module.vpc.module.endpoints.aws_vpc_endpoint.this["guardduty-data"]: Refreshing state... [id=vpce-0f5d362a5cdfcd3bf]
module.vpc.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20260226064209208000000004/arn:aws:iam::382156381095:policy/vpc-flow-log-to-cloudwatch-20260226064255546800000017]
module.app.module.api.module.alb["this"].aws_lb_listener.this["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:382156381095:listener/app/sebt-development-api/189f37944ccc954a/66c8e3d130180e0e]
module.app.module.api.module.alb["this"].aws_lb_listener.this["https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:382156381095:listener/app/sebt-development-api/189f37944ccc954a/c24439d9fda5ae13]
module.app.module.web.module.alb["this"].aws_lb_listener.this["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:382156381095:listener/app/sebt-development-web/047fda3ce1cc1fe6/24a9e05f5dc81b30]
module.app.module.web.module.alb["this"].aws_lb_listener.this["https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:382156381095:listener/app/sebt-development-web/047fda3ce1cc1fe6/b6a2b1fd9a595e3e]
module.app.module.api.module.task_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1198318042]
module.app.module.api.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1506675781]
module.app.module.api.aws_route53_record.endpoint["this"]: Refreshing state... [id=Z099642439GM3YJ1G5DMR_api.dev.dc.sebt-portal.codeforamerica.app_A]
module.app.module.web.aws_route53_record.endpoint["this"]: Refreshing state... [id=Z099642439GM3YJ1G5DMR_origin.dev.dc.sebt-portal.codeforamerica.app_A]
module.app.module.cloudfront_waf.data.aws_cloudfront_cache_policy.policy: Reading...
module.app.module.cloudfront_waf.data.aws_cloudfront_response_headers_policy.policy: Reading...
module.app.module.api.aws_iam_policy.secrets: Refreshing state... [id=arn:aws:iam::382156381095:policy/sebt-portal-dc-development-api-secrets-access-20260226071124729800000024]
module.app.module.database.aws_security_group_rule.this["ingress_sg_0"]: Refreshing state... [id=sgrule-2718927651]
module.app.module.cloudfront_waf.data.aws_cloudfront_origin_request_policy.policy: Reading...
module.app.module.cloudfront_waf.terraform_data.origin_alb: Refreshing state... [id=fc22f524-b83a-4607-7328-ac533f323882]
module.app.module.cloudfront_waf.data.aws_lb_listener.origin["this"]: Reading...
module.app.module.cloudfront_waf.data.aws_lb.origin["this"]: Reading...
module.app.module.cloudfront_waf.terraform_data.prefix: Refreshing state... [id=f5f78e98-e8e2-2612-7c0c-b772869a0cab]
module.app.module.cloudfront_waf.aws_acm_certificate.subdomain: Refreshing state... [id=arn:aws:acm:us-east-1:382156381095:certificate/4cc9acbf-fde7-4d34-87df-3c607dc9eb34]
module.app.module.cloudfront_waf.aws_cloudfront_vpc_origin.this["this"]: Refreshing state... [id=vo_1alVSFMEk4uFBbNmXS4dNY]
module.app.module.cloudfront_waf.data.aws_lb_listener.origin["this"]: Read complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:382156381095:listener/app/sebt-development-web/047fda3ce1cc1fe6/b6a2b1fd9a595e3e]
module.app.module.api.aws_iam_role_policy_attachments_exclusive.task: Refreshing state...
module.app.module.api.aws_iam_role_policy_attachments_exclusive.execution: Refreshing state...
module.app.module.api.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0]: Refreshing state... [id=sebt-portal-dc-development-api]
module.app.module.cloudfront_waf.data.aws_cloudfront_response_headers_policy.policy: Read complete after 0s [id=60669652-455b-4ae9-85a4-c4c02393f86c]
module.app.module.web.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0]: Refreshing state... [id=sebt-portal-dc-development-web]
module.app.module.cloudfront_waf.data.aws_lb.origin["this"]: Read complete after 0s [id=arn:aws:elasticloadbalancing:us-east-1:382156381095:loadbalancer/app/sebt-development-web/047fda3ce1cc1fe6]
module.app.module.cloudfront_waf.aws_lb_listener_certificate.origin["this"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:382156381095:listener/app/sebt-development-web/047fda3ce1cc1fe6/b6a2b1fd9a595e3e_arn:aws:acm:us-east-1:382156381095:certificate/4cc9acbf-fde7-4d34-87df-3c607dc9eb34]
module.app.module.cloudfront_waf.aws_route53_record.validation["dev.dc.sebt-portal.codeforamerica.app"]: Refreshing state... [id=Z099642439GM3YJ1G5DMR__ffd7cfd855150ab19fbb5d4e82676bed.dev.dc.sebt-portal.codeforamerica.app._CNAME]
module.app.module.cloudfront_waf.data.aws_cloudfront_cache_policy.policy: Read complete after 1s [id=4135ea2d-6df8-44a3-9df3-4b5a84be39ad]
module.app.module.cloudfront_waf.data.aws_cloudfront_origin_request_policy.policy: Read complete after 1s [id=216adef6-5c7f-47e4-b989-5492eafa07d3]
module.app.module.web.module.ecs_service.module.fargate.aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:382156381095:service/sebt-portal-dc-development-web/sebt-portal-dc-development-web]
module.app.module.api.module.ecs_service.module.fargate.aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:382156381095:service/sebt-portal-dc-development-api/sebt-portal-dc-development-api]
module.app.module.cloudfront_waf.aws_acm_certificate_validation.validation: Refreshing state... [id=2026-02-26 06:46:18.798 +0000 UTC]
module.app.module.cloudfront_waf.aws_wafv2_web_acl.waf: Refreshing state... [id=9ad50ebd-b363-4dde-9741-c95c4c49dc22]
module.app.module.cloudfront_waf.aws_wafv2_web_acl_logging_configuration.waf: Refreshing state... [id=arn:aws:wafv2:us-east-1:382156381095:global/webacl/sebt-portal-dc-development/9ad50ebd-b363-4dde-9741-c95c4c49dc22]
module.app.module.cloudfront_waf.aws_cloudfront_distribution.waf: Refreshing state... [id=ECZGG0ZHBJWDV]
module.app.module.cloudfront_waf.aws_route53_record.subdomain: Refreshing state... [id=Z099642439GM3YJ1G5DMR_dev.dc.sebt-portal.codeforamerica.app_A]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.app.module.api.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:382156381095:service/sebt-portal-dc-development-api/sebt-portal-dc-development-api"
        name                               = "sebt-portal-dc-development-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:382156381095:task-definition/sebt-portal-dc-development-api:33" -> (known after apply)
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.app.module.web.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:382156381095:service/sebt-portal-dc-development-web/sebt-portal-dc-development-web"
        name                               = "sebt-portal-dc-development-web"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:382156381095:task-definition/sebt-portal-dc-development-web:33" -> (known after apply)
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.app.module.api.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:382156381095:task-definition/sebt-portal-dc-development-api:33" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:382156381095:task-definition/sebt-portal-dc-development-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints      = []
                    name             = "otel-collector"
                  - portMappings     = []
                  - systemControls   = []
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  ~ image             = "382156381095.dkr.ecr.us-east-1.amazonaws.com/sebt-portal-dc-development-api:d2efe4f828d2e4beb6e54291775cb0d9b40d55bf" -> "382156381095.dkr.ecr.us-east-1.amazonaws.com/sebt-portal-dc-development-api:0f07a68df8f409fad56b0348667de6e8f8a9d838"
                  - mountPoints       = []
                    name              = "sebt-portal-dc-development-api"
                  ~ portMappings      = [
                      ~ {
                          - hostPort      = 8080
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                    # (8 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "sebt-portal-dc-development-api" -> (known after apply)
      ~ revision                 = 33 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)
    }

  # module.app.module.web.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:382156381095:task-definition/sebt-portal-dc-development-web:33" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:382156381095:task-definition/sebt-portal-dc-development-web" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - mountPoints      = []
                    name             = "otel-collector"
                  - portMappings     = []
                  - systemControls   = []
                  - volumesFrom      = []
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  ~ image             = "382156381095.dkr.ecr.us-east-1.amazonaws.com/sebt-portal-dc-development-web:d2efe4f828d2e4beb6e54291775cb0d9b40d55bf" -> "382156381095.dkr.ecr.us-east-1.amazonaws.com/sebt-portal-dc-development-web:0f07a68df8f409fad56b0348667de6e8f8a9d838"
                  - mountPoints       = []
                    name              = "sebt-portal-dc-development-web"
                  ~ portMappings      = [
                      ~ {
                          - hostPort      = 3000
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "sebt-portal-dc-development-web" -> (known after apply)
      ~ revision                 = 33 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/app.api/iam.tf line 96, in resource "aws_iam_policy" "appconfig":
  96:           data.aws_region.current.name,

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 30 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

## Plan output — dev-co

```
module.app.module.web.module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:929751802067:cluster/sebt-portal-co-development-web]
module.app.module.ses.data.aws_partition.current: Reading...
module.app.module.api.module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:929751802067:cluster/sebt-portal-co-development-api]
module.logging.data.aws_lambda_functions.all: Reading...
data.aws_route53_zone.main: Reading...
module.state_secrets.data.aws_region.current: Reading...
module.app.module.web.aws_ssm_parameter.otel_config: Refreshing state... [id=/sebt-portal-co/development/web/otel]
module.app.module.api.aws_ssm_parameter.otel_config: Refreshing state... [id=/sebt-portal-co/development/api/otel]
module.app.module.web.aws_iam_role.execution: Refreshing state... [id=sebt-portal-co-development-web-exec]
module.logging.module.s3.aws_s3_bucket.main: Refreshing state... [id=sebt-portal-co-development-logs]
module.app.module.ses.data.aws_partition.current: Read complete after 0s [id=aws]
module.state_secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app.module.appconfig[0].aws_appconfig_application.this: Refreshing state... [id=g4moa3r]
module.app.module.api.aws_iam_role.task: Refreshing state... [id=sebt-portal-co-development-api-task]
module.app.module.api.aws_iam_role.execution: Refreshing state... [id=sebt-portal-co-development-api-exec]
module.logging.module.s3.data.aws_caller_identity.current: Reading...
module.logging.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.app.module.database.data.aws_region.current: Reading...
module.app.module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app.module.api.aws_acm_certificate.endpoint["this"]: Refreshing state... [id=arn:aws:acm:us-east-1:929751802067:certificate/f4b3ef50-abb3-4b22-89c3-31e841eb0908]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-09df7d35c6a7e86e4]
module.logging.module.s3.data.aws_caller_identity.current: Read complete after 0s [id=929751802067]
module.app.module.web.aws_acm_certificate.endpoint["this"]: Refreshing state... [id=arn:aws:acm:us-east-1:929751802067:certificate/acf0812f-e439-4f4a-91a1-706e2da03d71]
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.app.module.secrets.data.aws_partition.current: Reading...
module.app.module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.app.module.secrets.data.aws_region.current: Reading...
module.app.module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_caller_identity.identity: Reading...
module.app.module.ses.aws_iam_user.smtp: Refreshing state... [id=sebt-portal-co-development-ses-smtp]
module.app.module.web.aws_iam_role.task: Refreshing state... [id=sebt-portal-co-development-web-task]
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=929751802067]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
data.aws_route53_zone.main: Read complete after 1s [id=Z098414410HX6MSQGTBR7]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.logging.data.aws_region.current: Reading...
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app.module.database.data.aws_rds_engine_version.this: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 0s [id=1315226949]
module.app.module.ses.aws_ses_domain_identity.main: Refreshing state... [id=dev.co.sebt-portal.codeforamerica.app]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 0s [id=2187510914]
module.state_secrets.data.aws_partition.current: Reading...
module.state_secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.module.s3.data.aws_organizations_organization.current: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.logging.module.s3.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.app.module.web.module.alb["this"].data.aws_partition.current: Reading...
module.app.module.web.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.app.module.ses.aws_secretsmanager_secret.smtp: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:929751802067:secret:sebt-portal-co-development-ses-smtp-credentials-KJpZRz]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 0s [id=1808222790]
module.state_secrets.data.aws_caller_identity.identity: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 0s [id=1314884315]
data.aws_ecr_repository.api: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 0s [id=874300523]
module.app.module.api.module.alb["this"].data.aws_partition.current: Reading...
module.app.module.api.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app.module.api.data.aws_caller_identity.identity: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 0s [id=2644592029]
module.logging.data.aws_partition.current: Reading...
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.app.module.database.data.aws_caller_identity.current: Reading...
module.state_secrets.data.aws_caller_identity.identity: Read complete after 0s [id=929751802067]
module.vpc.data.aws_availability_zones.available: Reading...
module.app.module.api.data.aws_caller_identity.identity: Read complete after 0s [id=929751802067]
module.app.module.web.data.aws_region.current: Reading...
module.app.module.web.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app.module.database.data.aws_partition.current: Reading...
module.app.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
data.aws_ecr_repository.web: Reading...
module.app.module.api.data.aws_partition.current: Reading...
module.app.module.api.data.aws_partition.current: Read complete after 0s [id=aws]
module.app.module.secrets.data.aws_caller_identity.identity: Reading...
module.app.module.database.data.aws_caller_identity.current: Read complete after 0s [id=929751802067]
module.app.data.aws_ec2_managed_prefix_list.cloudfront: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.app.module.ses.data.aws_region.current: Reading...
module.app.module.ses.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.app.module.database.data.aws_rds_engine_version.this: Read complete after 0s [id=16.00.4215.2.v1]
module.app.module.api.data.aws_region.current: Reading...
module.app.module.api.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app.module.web.data.aws_partition.current: Reading...
module.app.module.web.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.module.s3.data.aws_region.current: Reading...
module.app.module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=929751802067]
module.logging.module.s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app.module.web.data.aws_caller_identity.identity: Reading...
module.app.module.api.module.ecs.aws_ecs_cluster_capacity_providers.main[0]: Refreshing state... [id=sebt-portal-co-development-api]
module.app.module.web.module.ecs.aws_ecs_cluster_capacity_providers.main[0]: Refreshing state... [id=sebt-portal-co-development-web]
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=929751802067]
module.app.module.appconfig[0].aws_appconfig_configuration_profile.app_settings: Refreshing state... [id=3indmpo:g4moa3r]
module.app.module.web.data.aws_caller_identity.identity: Read complete after 0s [id=929751802067]
module.app.module.appconfig[0].aws_appconfig_environment.this: Refreshing state... [id=matqn1h:g4moa3r]
module.app.module.appconfig[0].aws_appconfig_configuration_profile.feature_flags: Refreshing state... [id=dmpwqd0:g4moa3r]
module.app.module.ses.aws_iam_access_key.smtp: Refreshing state... [id=AKIA5Q6MGUDJ75R3X4PT]
module.app.module.ses.aws_iam_user_policy.smtp: Refreshing state... [id=sebt-portal-co-development-ses-smtp:ses-send]
module.logging.module.s3.data.aws_organizations_organization.current: Read complete after 0s [id=o-f5mr0gq6lc]
module.state_secrets.aws_kms_key.secrets: Refreshing state... [id=cb4cfbd6-1584-4c48-9798-9c33f51075dc]
module.vpc.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20260226193035366500000001]
module.app.data.aws_ec2_managed_prefix_list.cloudfront: Read complete after 0s [id=pl-3b927c52]
module.app.module.ses.aws_ses_domain_dkim.main: Refreshing state... [id=dev.co.sebt-portal.codeforamerica.app]
module.app.module.ses.aws_ses_domain_mail_from.main: Refreshing state... [id=dev.co.sebt-portal.codeforamerica.app]
module.app.module.database.aws_kms_key.database: Refreshing state... [id=e60d9f8e-80bc-4bc2-8801-fe6cb0ed49ae]
module.app.module.api.aws_kms_key.fargate: Refreshing state... [id=64a4625b-4636-4492-8c5d-aeca669de17f]
module.app.module.secrets.aws_kms_key.secrets: Refreshing state... [id=d194ddaf-3030-4fdf-ba60-5d4d0a8a9445]
module.app.module.web.aws_kms_key.fargate: Refreshing state... [id=8d04999d-d45c-453b-98e6-370d3f45eb5c]
module.logging.module.s3.aws_s3_bucket_versioning.main: Refreshing state... [id=sebt-portal-co-development-logs]
data.aws_ecr_repository.api: Read complete after 1s [id=sebt-portal-co-development-api]
module.logging.module.s3.aws_s3_bucket_ownership_controls.main: Refreshing state... [id=sebt-portal-co-development-logs]
module.logging.module.s3.aws_s3_bucket_public_access_block.main: Refreshing state... [id=sebt-portal-co-development-logs]
module.logging.module.s3.aws_s3_bucket_server_side_encryption_configuration.main: Refreshing state... [id=sebt-portal-co-development-logs]
data.aws_ecr_repository.web: Read complete after 1s [id=sebt-portal-co-development-web]
module.logging.module.s3.data.aws_iam_policy_document.default: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Read complete after 0s [id=269892978]
module.app.module.ses.aws_secretsmanager_secret_version.smtp: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:929751802067:secret:sebt-portal-co-development-ses-smtp-credentials-KJpZRz|terraform-20260226193037818700000005]
module.logging.aws_kms_key.logs: Refreshing state... [id=0ad7fb2a-aebc-4c41-8adc-a6da6a8d5b0d]
module.logging.aws_s3_bucket_object_lock_configuration.lock["this"]: Refreshing state... [id=sebt-portal-co-development-logs]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0cddf6915e6107b7b]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d9ecc4fb03dbac9e]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0ff2644875029eba6]
module.app.module.api.aws_iam_policy.appconfig["this"]: Refreshing state... [id=arn:aws:iam::929751802067:policy/sebt-portal-co-development-api-appconfig]
module.app.module.database.aws_kms_alias.database: Refreshing state... [id=alias/sebt-portal-co/development/database]
module.app.module.api.aws_kms_alias.fargate: Refreshing state... [id=alias/sebt-portal-co/development/api]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0261cee59a2002f3f]
module.app.module.secrets.aws_kms_alias.secrets: Refreshing state... [id=alias/sebt-portal-co/development/api/secrets]
module.app.module.web.aws_kms_alias.fargate: Refreshing state... [id=alias/sebt-portal-co/development/web]
module.logging.module.s3.data.aws_iam_policy_document.combined: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Read complete after 0s [id=1790112856]
module.app.module.ses.aws_route53_record.ses_verification: Refreshing state... [id=Z098414410HX6MSQGTBR7__amazonses.dev.co.sebt-portal.codeforamerica.app_TXT]
module.app.module.ses.aws_route53_record.mx_mail_from: Refreshing state... [id=Z098414410HX6MSQGTBR7_bounce.dev.co.sebt-portal.codeforamerica.app_MX]
module.app.module.ses.aws_route53_record.spf_mail_from: Refreshing state... [id=Z098414410HX6MSQGTBR7_bounce.dev.co.sebt-portal.codeforamerica.app_TXT]
module.app.module.ses.aws_route53_record.dkim[1]: Refreshing state... [id=Z098414410HX6MSQGTBR7_bxhxojcloutuzauhmqs5ctoypxd5fj2w._domainkey.dev.co.sebt-portal.codeforamerica.app_CNAME]
module.app.module.ses.aws_route53_record.dkim[2]: Refreshing state... [id=Z098414410HX6MSQGTBR7_lddrcz3tg2maq2ypc72codxg2dlfuxr4._domainkey.dev.co.sebt-portal.codeforamerica.app_CNAME]
module.app.module.ses.aws_route53_record.dkim[0]: Refreshing state... [id=Z098414410HX6MSQGTBR7_uxuf6sp3e3tb3xxij3hyjdfwlqdz7omq._domainkey.dev.co.sebt-portal.codeforamerica.app_CNAME]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f28b78a7ee509b9a]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a337046812576f4e]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-056a10a2352671318]
module.app.module.ses.aws_route53_record.dmarc: Refreshing state... [id=Z098414410HX6MSQGTBR7__dmarc.dev.co.sebt-portal.codeforamerica.app_TXT]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e451d480795185bd]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-07d75117e34ffa63c]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0f47031cd8dcf8d0d]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0348b4d82b7002887]
module.logging.module.s3.aws_s3_bucket_policy.main: Refreshing state... [id=sebt-portal-co-development-logs]
module.vpc.module.endpoints.aws_security_group.this[0]: Refreshing state... [id=sg-03afd050e686c413e]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0e8acccbd48c8fcde]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-062f607b1d566de00]
module.logging.aws_kms_alias.logs: Refreshing state... [id=alias/sebt-portal-co/development/logs]
module.logging.aws_cloudwatch_log_group.logs["waf"]: Refreshing state... [id=aws-waf-logs-cfa/sebt-portal-co/development]
module.app.module.web.aws_route53_record.endpoint_validation["origin.dev.co.sebt-portal.codeforamerica.app"]: Refreshing state... [id=Z098414410HX6MSQGTBR7__975406988c46fbfd36f5365f751b121a.origin.dev.co.sebt-portal.codeforamerica.app._CNAME]
module.app.module.api.aws_route53_record.endpoint_validation["api.dev.co.sebt-portal.codeforamerica.app"]: Refreshing state... [id=Z098414410HX6MSQGTBR7__b56b1d8120cb28c37d2bb360f6d0dccc.api.dev.co.sebt-portal.codeforamerica.app._CNAME]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e451d480795185bd1080289494]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06f24bcc3e8c9a365]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01a694e43c16e04df]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-02e10ce14415555aa]
module.app.module.api.aws_iam_policy.execution: Refreshing state... [id=arn:aws:iam::929751802067:policy/sebt-portal-co-development-api-execution]
module.vpc.module.endpoints.aws_security_group_rule.this["ingress_https"]: Refreshing state... [id=sgrule-3367030384]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0362ec936b984d320]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0714600e0fc91d8e3]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c75ccb6eb8eaa1d3]
module.app.module.web.aws_iam_policy.execution: Refreshing state... [id=arn:aws:iam::929751802067:policy/sebt-portal-co-development-web-execution]
module.app.module.secrets.module.secrets_manager["app"].aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:929751802067:secret:sebt-portal-co/development/api/app-20260226193118391200000009-d4UK3U]
module.app.module.database.aws_security_group.database: Refreshing state... [id=sg-0fb19db60ed1b372b]
module.app.module.web.data.aws_vpc.current: Reading...
module.app.module.api.data.aws_vpc.current: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.app.module.web.aws_acm_certificate_validation.endpoint["this"]: Refreshing state... [id=2026-02-26 19:31:28.131 +0000 UTC]
module.app.module.api.aws_acm_certificate_validation.endpoint["this"]: Refreshing state... [id=2026-02-26 19:31:28.056 +0000 UTC]
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 0s [id=us-east-1]
module.app.module.secrets.module.secrets_manager["app"].aws_secretsmanager_secret_version.ignore_changes[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:929751802067:secret:sebt-portal-co/development/api/app-20260226193118391200000009-d4UK3U|terraform-2026022619311940130000000b]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-034f5f692a56a2d14]
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 0s [id=us-east-1]
module.app.module.api.module.alb["this"].aws_lb_target_group.this["endpoint"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:929751802067:targetgroup/sebt-development-api-app/2883df76fe788399]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 0s [id=us-east-1]
module.app.module.api.module.alb["this"].aws_security_group.this[0]: Refreshing state... [id=sg-09f89e7250bc8678e]
module.app.module.web.module.prefix_security_group["this"].aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-049b03248976b6f15]
module.app.module.web.module.alb["this"].aws_security_group.this[0]: Refreshing state... [id=sg-081296c6d8049cb54]
module.app.module.api.module.endpoint_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0b9d32128a53b731b]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 0s [id=us-east-1]
module.app.module.web.module.endpoint_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-07c5a05c0bd2776f7]
module.app.module.web.module.alb["this"].aws_lb_target_group.this["endpoint"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:929751802067:targetgroup/sebt-development-web-app/ef6c6670a2e6bba4]
module.app.module.web.module.task_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0541c7c14184bc1f4]
module.app.module.database.aws_cloudwatch_log_group.error: Refreshing state... [id=/aws/rds/instance/sebt-portal-co-development-db/error]
module.app.module.database.aws_cloudwatch_log_group.agent: Refreshing state... [id=/aws/rds/instance/sebt-portal-co-development-db/agent]
module.app.module.api.aws_cloudwatch_log_group.this["service"]: Refreshing state... [id=/aws/ecs/sebt-portal-co/development/api]
module.app.module.web.aws_cloudwatch_log_group.this["service"]: Refreshing state... [id=/aws/ecs/sebt-portal-co/development/web]
module.vpc.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-09df7d35c6a7e86e4]
module.app.module.web.data.aws_vpc.current: Read complete after 0s [id=vpc-09df7d35c6a7e86e4]
module.logging.module.s3.aws_s3_bucket_lifecycle_configuration.main[0]: Refreshing state... [id=sebt-portal-co-development-logs]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-062f607b1d566de001080289494]
module.app.module.api.data.aws_vpc.current: Read complete after 0s [id=vpc-09df7d35c6a7e86e4]
module.app.module.web.module.prefix_security_group["this"].aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-638938419]
module.app.module.database.aws_db_subnet_group.main: Refreshing state... [id=sebt-portal-co-development-db-subnet-group]
module.app.module.web.module.task_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2292720514]
module.app.module.web.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1134792546]
module.app.module.web.module.endpoint_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3567680197]
module.app.module.web.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-3873024403]
module.app.module.web.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-3065888246]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 1s [id=1808222790]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 1s [id=1314884315]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.app.module.api.module.endpoint_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1937214784]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=874300523]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2268756278]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=1315226949]
module.app.module.api.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-3804531847]
module.app.module.api.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-213731970]
module.vpc.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-0dab778ac4c113691]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::929751802067:policy/vpc-flow-log-to-cloudwatch-20260226193124499600000017]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.app.module.web.module.alb["this"].aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:929751802067:loadbalancer/app/sebt-development-web/5b2e35348ce03418]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.app.module.database.aws_db_instance.main: Refreshing state... [id=db-FWQHH27OSR772SGWVBX4CLXCPI]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.app.module.api.module.alb["this"].aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:929751802067:loadbalancer/app/sebt-development-api/bd09888620fda826]
module.app.module.api.module.task_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-00c205d0b5ce4a60e]
module.app.module.web.aws_iam_policy.secrets: Refreshing state... [id=arn:aws:iam::929751802067:policy/sebt-portal-co-development-web-secrets-access-2026022619312043760000000d]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ecr.api"]: Refreshing state... [id=vpce-01a7ba3d39d8371d3]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssmmessages"]: Refreshing state... [id=vpce-07c1a2a552afdf079]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm-incidents"]: Refreshing state... [id=vpce-0f04bb41a13acb3ba]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ec2"]: Refreshing state... [id=vpce-049dfb2380f803abd]
module.vpc.module.endpoints.aws_vpc_endpoint.this["guardduty-data"]: Refreshing state... [id=vpce-0b5238be9d78a77bb]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ecr.dkr"]: Refreshing state... [id=vpce-009fc5ad6648a1376]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm-contacts"]: Refreshing state... [id=vpce-007e5a78b4198a226]
module.vpc.module.endpoints.aws_vpc_endpoint.this["s3"]: Refreshing state... [id=vpce-08525e6db06733eab]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ec2messages"]: Refreshing state... [id=vpce-0cea1864aef8b4739]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm"]: Refreshing state... [id=vpce-0513530116f346a97]
module.vpc.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20260226193035366500000001/arn:aws:iam::929751802067:policy/vpc-flow-log-to-cloudwatch-20260226193124499600000017]
module.app.module.web.aws_iam_role_policy_attachments_exclusive.task: Refreshing state...
module.app.module.web.aws_iam_role_policy_attachments_exclusive.execution: Refreshing state...
module.app.module.web.module.alb["this"].aws_lb_listener.this["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:929751802067:listener/app/sebt-development-web/5b2e35348ce03418/e3fba68c6620db6b]
module.app.module.web.module.alb["this"].aws_lb_listener.this["https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:929751802067:listener/app/sebt-development-web/5b2e35348ce03418/cd6ddd06abf44432]
module.app.module.api.module.alb["this"].aws_lb_listener.this["https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:929751802067:listener/app/sebt-development-api/bd09888620fda826/478e4d187d3b3c11]
module.app.module.api.module.alb["this"].aws_lb_listener.this["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:929751802067:listener/app/sebt-development-api/bd09888620fda826/3ba3e0fdca65cfe9]
module.app.module.api.module.task_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1170694496]
module.app.module.api.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1244517283]
module.app.module.web.aws_route53_record.endpoint["this"]: Refreshing state... [id=Z098414410HX6MSQGTBR7_origin.dev.co.sebt-portal.codeforamerica.app_A]
module.app.module.api.aws_route53_record.endpoint["this"]: Refreshing state... [id=Z098414410HX6MSQGTBR7_api.dev.co.sebt-portal.codeforamerica.app_A]
module.app.module.cloudfront_waf.data.aws_cloudfront_cache_policy.policy: Reading...
module.app.module.cloudfront_waf.data.aws_cloudfront_response_headers_policy.policy: Reading...
module.app.module.api.aws_iam_policy.secrets: Refreshing state... [id=arn:aws:iam::929751802067:policy/sebt-portal-co-development-api-secrets-access-20260226195703698300000024]
module.app.module.database.aws_security_group_rule.this["ingress_sg_0"]: Refreshing state... [id=sgrule-2221677209]
module.app.module.cloudfront_waf.data.aws_cloudfront_origin_request_policy.policy: Reading...
module.app.module.cloudfront_waf.terraform_data.prefix: Refreshing state... [id=140edc95-c4c3-ecbb-ba17-946dcfb3794f]
module.app.module.cloudfront_waf.terraform_data.origin_alb: Refreshing state... [id=6de7dbfd-d630-651f-9cc8-69cb8b219b17]
module.app.module.cloudfront_waf.data.aws_lb.origin["this"]: Reading...
module.app.module.cloudfront_waf.data.aws_lb_listener.origin["this"]: Reading...
module.app.module.cloudfront_waf.aws_acm_certificate.subdomain: Refreshing state... [id=arn:aws:acm:us-east-1:929751802067:certificate/e1f24eb8-3864-4d49-986d-522d41f1a0f9]
module.app.module.cloudfront_waf.aws_cloudfront_vpc_origin.this["this"]: Refreshing state... [id=vo_6DbhJejq6MZF1pA34wKF5e]
module.app.module.api.aws_iam_role_policy_attachments_exclusive.task: Refreshing state...
module.app.module.cloudfront_waf.data.aws_lb_listener.origin["this"]: Read complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:929751802067:listener/app/sebt-development-web/5b2e35348ce03418/cd6ddd06abf44432]
module.app.module.api.aws_iam_role_policy_attachments_exclusive.execution: Refreshing state...
module.app.module.cloudfront_waf.aws_route53_record.validation["dev.co.sebt-portal.codeforamerica.app"]: Refreshing state... [id=Z098414410HX6MSQGTBR7__444cc5928f2ee842f697814343f156b0.dev.co.sebt-portal.codeforamerica.app._CNAME]
module.app.module.cloudfront_waf.data.aws_lb.origin["this"]: Read complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:929751802067:loadbalancer/app/sebt-development-web/5b2e35348ce03418]
module.app.module.cloudfront_waf.aws_lb_listener_certificate.origin["this"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:929751802067:listener/app/sebt-development-web/5b2e35348ce03418/cd6ddd06abf44432_arn:aws:acm:us-east-1:929751802067:certificate/e1f24eb8-3864-4d49-986d-522d41f1a0f9]
module.app.module.cloudfront_waf.data.aws_cloudfront_cache_policy.policy: Read complete after 1s [id=4135ea2d-6df8-44a3-9df3-4b5a84be39ad]
module.app.module.cloudfront_waf.data.aws_cloudfront_origin_request_policy.policy: Read complete after 1s [id=216adef6-5c7f-47e4-b989-5492eafa07d3]
module.app.module.cloudfront_waf.data.aws_cloudfront_response_headers_policy.policy: Read complete after 1s [id=60669652-455b-4ae9-85a4-c4c02393f86c]
module.app.module.api.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0]: Refreshing state... [id=sebt-portal-co-development-api]
module.app.module.web.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0]: Refreshing state... [id=sebt-portal-co-development-web]
module.app.module.web.module.ecs_service.module.fargate.aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:929751802067:service/sebt-portal-co-development-web/sebt-portal-co-development-web]
module.app.module.api.module.ecs_service.module.fargate.aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:929751802067:service/sebt-portal-co-development-api/sebt-portal-co-development-api]
module.app.module.cloudfront_waf.aws_acm_certificate_validation.validation: Refreshing state... [id=2026-02-26 19:35:44.882 +0000 UTC]
module.app.module.cloudfront_waf.aws_wafv2_web_acl.waf: Refreshing state... [id=a4f8e938-a3b4-47cd-ac85-4ba1a83e5ac6]
module.app.module.cloudfront_waf.aws_wafv2_web_acl_logging_configuration.waf: Refreshing state... [id=arn:aws:wafv2:us-east-1:929751802067:global/webacl/sebt-portal-co-development/a4f8e938-a3b4-47cd-ac85-4ba1a83e5ac6]
module.app.module.cloudfront_waf.aws_cloudfront_distribution.waf: Refreshing state... [id=E1G84YHI46MQZ5]
module.app.module.cloudfront_waf.aws_route53_record.subdomain: Refreshing state... [id=Z098414410HX6MSQGTBR7_dev.co.sebt-portal.codeforamerica.app_A]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.state_secrets.aws_kms_alias.secrets will be created
  + resource "aws_kms_alias" "secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/sebt-portal-co/development/state-secrets/secrets"
      + name_prefix    = (known after apply)
      + region         = "us-east-1"
      + target_key_arn = (known after apply)
      + target_key_id  = "cb4cfbd6-1584-4c48-9798-9c33f51075dc"
    }

  # module.app.module.api.aws_iam_policy.secrets will be updated in-place
  ~ resource "aws_iam_policy" "secrets" {
        id               = "arn:aws:iam::929751802067:policy/sebt-portal-co-development-api-secrets-access-20260226195703698300000024"
        name             = "sebt-portal-co-development-api-secrets-access-20260226195703698300000024"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "kms:Decrypt",
                          - "ssm:GetParameter",
                          - "ssm:GetParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:us-east-1:929751802067:key/64a4625b-4636-4492-8c5d-aeca669de17f",
                          - "arn:aws:ssm:us-east-1:929751802067:parameter/sebt-portal-co/development/api/otel",
                          - "arn:aws:secretsmanager:us-east-1:929751802067:secret:rds!db-277276e3-c2d6-4ca6-b1d4-efe4949cd1a7-1cDRTU",
                          - "arn:aws:secretsmanager:us-east-1:929751802067:secret:sebt-portal-co-development-ses-smtp-credentials-KJpZRz",
                          - "arn:aws:secretsmanager:us-east-1:929751802067:secret:sebt-portal-co/development/api/app-20260226193118391200000009-d4UK3U",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.app.module.web.aws_iam_policy.secrets will be updated in-place
  ~ resource "aws_iam_policy" "secrets" {
        id               = "arn:aws:iam::929751802067:policy/sebt-portal-co-development-web-secrets-access-2026022619312043760000000d"
        name             = "sebt-portal-co-development-web-secrets-access-2026022619312043760000000d"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "kms:Decrypt",
                          - "ssm:GetParameter",
                          - "ssm:GetParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:us-east-1:929751802067:key/8d04999d-d45c-453b-98e6-370d3f45eb5c",
                          - "arn:aws:ssm:us-east-1:929751802067:parameter/sebt-portal-co/development/web/otel",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.state_secrets.module.secrets_manager["cbms"].aws_secretsmanager_secret.this[0] will be created
  + resource "aws_secretsmanager_secret" "this" {
      + arn                            = (known after apply)
      + description                    = "OAuth 2.0 client credentials for the Colorado CBMS SEBT API."
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "sebt-portal-co/development/state-secrets/cbms-"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + region                         = "us-east-1"
      + tags_all                       = {
          + "environment" = "development"
          + "project"     = "sebt-portal"
          + "state"       = "co"
          + "tofu"        = "true"
        }

      + replica (known after apply)
    }

  # module.state_secrets.module.secrets_manager["cbms"].aws_secretsmanager_secret_version.ignore_changes[0] will be created
  + resource "aws_secretsmanager_secret_version" "ignore_changes" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "us-east-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.state_secrets.module.secrets_manager["oidc"].aws_secretsmanager_secret.this[0] will be created
  + resource "aws_secretsmanager_secret" "this" {
      + arn                            = (known after apply)
      + description                    = "MyColorado OIDC credentials for authentication."
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "sebt-portal-co/development/state-secrets/oidc-"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 7
      + region                         = "us-east-1"
      + tags_all                       = {
          + "environment" = "development"
          + "project"     = "sebt-portal"
          + "state"       = "co"
          + "tofu"        = "true"
        }

      + replica (known after apply)
    }

  # module.state_secrets.module.secrets_manager["oidc"].aws_secretsmanager_secret_version.ignore_changes[0] will be created
  + resource "aws_secretsmanager_secret_version" "ignore_changes" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + region               = "us-east-1"
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

  # module.app.module.api.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:929751802067:service/sebt-portal-co-development-api/sebt-portal-co-development-api"
        name                               = "sebt-portal-co-development-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:929751802067:task-definition/sebt-portal-co-development-api:31" -> (known after apply)
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.app.module.web.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:929751802067:service/sebt-portal-co-development-web/sebt-portal-co-development-web"
        name                               = "sebt-portal-co-development-web"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:929751802067:task-definition/sebt-portal-co-development-web:31" -> (known after apply)
        # (20 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.app.module.api.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:929751802067:task-definition/sebt-portal-co-development-api:31" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:929751802067:task-definition/sebt-portal-co-development-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - environment      = [
                      - {
                          - name  = "PREFETCH_LIST"
                          - value = "/applications/g4moa3r/environments/matqn1h/configurations/dmpwqd0,/applications/g4moa3r/environments/matqn1h/configurations/3indmpo"
                        },
                    ]
                  - essential        = false
                  - image            = "public.ecr.aws/aws-appconfig/aws-appconfig-agent:2.x"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sebt-portal-co/development/api"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "appconfig-agent"
                        }
                    }
                  - mountPoints      = []
                  - name             = "appconfig-agent"
                  - portMappings     = [
                      - {
                          - containerPort = 2772
                          - hostPort      = 2772
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - command          = [
                      - "--config=/etc/ecs/container-insights/otel-task-metrics-config.yaml",
                    ]
                  - cpu              = 256
                  - environment      = [
                      - {
                          - name  = "OTEL_LOG_LEVEL"
                          - value = "info"
                        },
                    ]
                  - essential        = false
                  - image            = "public.ecr.aws/aws-observability/aws-otel-collector:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sebt-portal-co/development/api"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "otel-collector"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "otel-collector"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "AOT_CONFIG_CONTENT"
                          - valueFrom = "arn:aws:ssm:us-east-1:929751802067:parameter/sebt-portal-co/development/api/otel"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - cpu               = 256
                  - dependsOn         = [
                      - {
                          - condition     = "START"
                          - containerName = "appconfig-agent"
                        },
                    ]
                  - environment       = [
                      - {
                          - name  = "ASPNETCORE_ENVIRONMENT"
                          - value = "development"
                        },
                      - {
                          - name  = "AppConfig__Agent__ApplicationId"
                          - value = "g4moa3r"
                        },
                      - {
                          - name  = "AppConfig__Agent__BaseUrl"
                          - value = "http://localhost:2772"
                        },
                      - {
                          - name  = "AppConfig__Agent__EnvironmentId"
                          - value = "matqn1h"
                        },
                      - {
                          - name  = "AppConfig__AppSettings__ProfileId"
                          - value = "3indmpo"
                        },
                      - {
                          - name  = "AppConfig__FeatureFlags__ProfileId"
                          - value = "dmpwqd0"
                        },
                      - {
                          - name  = "DB_HOST"
                          - value = "sebt-portal-co-development-db.c6xmuw8eegvn.us-east-1.rds.amazonaws.com"
                        },
                      - {
                          - name  = "DB_NAME"
                          - value = "SebtPortal"
                        },
                      - {
                          - name  = "DB_PORT"
                          - value = "1433"
                        },
                      - {
                          - name  = "EmailOtpSenderServiceSettings__SenderEmail"
                          - value = "noreply@dev.co.sebt-portal.codeforamerica.app"
                        },
                      - {
                          - name  = "PluginAssemblyPaths__0"
                          - value = "plugins-co"
                        },
                      - {
                          - name  = "STATE"
                          - value = "co"
                        },
                      - {
                          - name  = "Seeding__EmailPattern"
                          - value = "sebt.co+{0}@codeforamerica.org"
                        },
                      - {
                          - name  = "Seeding__Enabled"
                          - value = "true"
                        },
                      - {
                          - name  = "SmtpClientSettings__EnableSsl"
                          - value = "true"
                        },
                      - {
                          - name  = "SmtpClientSettings__SmtpPort"
                          - value = "587"
                        },
                      - {
                          - name  = "SmtpClientSettings__SmtpServer"
                          - value = "email-smtp.us-east-1.amazonaws.com"
                        },
                      - {
                          - name  = "UseMockHouseholdData"
                          - value = "true"
                        },
                    ]
                  - essential         = true
                  - image             = "929751802067.dkr.ecr.us-east-1.amazonaws.com/sebt-portal-co-development-api:4295b77cd5f06480783027e8c6a1c723963c281c"
                  - linuxParameters   = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration  = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sebt-portal-co/development/api"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory            = 512
                  - memoryReservation = 512
                  - mountPoints       = []
                  - name              = "sebt-portal-co-development-api"
                  - portMappings      = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets           = [
                      - {
                          - name      = "DB_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:929751802067:secret:rds!db-277276e3-c2d6-4ca6-b1d4-efe4949cd1a7-1cDRTU:password::"
                        },
                      - {
                          - name      = "DB_USER"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:929751802067:secret:rds!db-277276e3-c2d6-4ca6-b1d4-efe4949cd1a7-1cDRTU:username::"
                        },
                      - {
                          - name      = "IdentifierHasher__SecretKey"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:929751802067:secret:sebt-portal-co/development/api/app-20260226193118391200000009-d4UK3U:identifier_hasher_secret_key::"
                        },
                      - {
                          - name      = "JwtSettings__SecretKey"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:929751802067:secret:sebt-portal-co/development/api/app-20260226193118391200000009-d4UK3U:jwt_secret_key::"
                        },
                      - {
                          - name      = "SmtpClientSettings__Password"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:929751802067:secret:sebt-portal-co-development-ses-smtp-credentials-KJpZRz:password::"
                        },
                      - {
                          - name      = "SmtpClientSettings__UserName"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:929751802067:secret:sebt-portal-co-development-ses-smtp-credentials-KJpZRz:username::"
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "sebt-portal-co-development-api" -> (known after apply)
      ~ revision                 = 31 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)
    }

  # module.app.module.web.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:929751802067:task-definition/sebt-portal-co-development-web:31" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:929751802067:task-definition/sebt-portal-co-development-web" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command          = [
                      - "--config=/etc/ecs/container-insights/otel-task-metrics-config.yaml",
                    ]
                  - cpu              = 256
                  - environment      = [
                      - {
                          - name  = "OTEL_LOG_LEVEL"
                          - value = "info"
                        },
                    ]
                  - essential        = false
                  - image            = "public.ecr.aws/aws-observability/aws-otel-collector:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sebt-portal-co/development/web"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "otel-collector"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "otel-collector"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "AOT_CONFIG_CONTENT"
                          - valueFrom = "arn:aws:ssm:us-east-1:929751802067:parameter/sebt-portal-co/development/web/otel"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - cpu               = 256
                  - environment       = [
                      - {
                          - name  = "BACKEND_URL"
                          - value = "https://api.dev.co.sebt-portal.codeforamerica.app"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_API_BASE_URL"
                          - value = "https://api.dev.co.sebt-portal.codeforamerica.app"
                        },
                      - {
                          - name  = "NEXT_PUBLIC_STATE"
                          - value = "co"
                        },
                      - {
                          - name  = "STATE"
                          - value = "co"
                        },
                    ]
                  - essential         = true
                  - image             = "929751802067.dkr.ecr.us-east-1.amazonaws.com/sebt-portal-co-development-web:4295b77cd5f06480783027e8c6a1c723963c281c"
                  - linuxParameters   = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration  = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sebt-portal-co/development/web"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory            = 512
                  - memoryReservation = 512
                  - mountPoints       = []
                  - name              = "sebt-portal-co-development-web"
                  - portMappings      = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "sebt-portal-co-development-web" -> (known after apply)
      ~ revision                 = 31 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)
    }

Plan: 7 to add, 4 to change, 2 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/app.api/iam.tf line 96, in resource "aws_iam_policy" "appconfig":
  96:           data.aws_region.current.name,

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 33 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```